
# https://pyprog.pro/python/py/list/list_generat.html

# обычная запись цикла for

a = []
for i in range(7):
    a.append(i)
print(a)  # --> [0, 1, 2, 3, 4, 5, 6]


# _1 шаблон генератора списков [выражение for val in коллекция]

a = [0 for i in range(7)]
print(a)  # --> [0, 0, 0, 0, 0, 0, 0]  # можно выводить константу нужное число раз

a = [i for i in range(7)]
print(a)  # --> [0, 1, 2, 3, 4, 5, 6]  # можно заменить константу переменной

a = [i**2 for i in range(7, 15)]  # можно изменять выводимую переменную
print(a)  # --> [49, 64, 81, 100, 121, 144, 169, 196]

a = [i for i in 'hello']  # можно обходить любые итерабельные объекты
print(a)  # --> ['h', 'e', 'l', 'l', 'o']

a = [ord(i) for i in 'hello']  # допустимо использовать функции внутри генератора
print(a)  # --> ['h', 'e', 'l', 'l', 'o']

import random
b = [random.randint(-10, 10) for i in range(10)]  # используем генераторы в качестве переменной
print(b)  # --> [5, -5, -3, -7, -2, 5, -7, 8, -7, 7]

c = [abs(elem) for elem in b]  # создаем переменные на основе элементов другого списка
print(c)  # --> [5, 5, 3, 7, 2, 5, 7, 8, 7, 7]

''' при помощи генераторов можно менять исходные последовательности '''

b = [elem+1 for elem in b]  # создаем переменные на основе элементов другого списка
print(b)  # --> [6, -4, -2, -6, -1, 6, -6, 9, -6, 8]


# ---------------------------------------------------------------
# # _2 шаблон генератора списков с условием [выражение for val in коллекция if условие]

import random
b = [random.randint(-10, 10) for i in range(10)]  # используем генераторы в качестве переменной
print(b)  # --> [-6, 0, -4, 9, 0, -2, 7, -5, -5, 10]

b = [i for i in b if i % 2 == 0]  # задаем условие отбора
print(b)  # --> [-6, 0, -4, 0, -2, 10]

b = [i for i in b if i % 2 == 0 and i % 3 == 0]  # задаем сложное условие
print(b)  # --> [-6, 0, 0]


# ---------------------------------------------------------------
# _3 аналог функции map

d = input().split()  # позволяет разбить введенное по пробелам и сразу создает из этого список
d = [int(i) for i in d]
print(d)  # --> [2, 5, 8]

# ---------------------------------------------------------------
# _4 инициализация двумерного списка

n = 4  # строк
m = 5  # стоблцов

a = [[0]*m for i in range(n)]
print(a)  # --> [[0, 0, 0, 0, 0], [0, 0, 0, 0, 0], [0, 0, 0, 0, 0], [0, 0, 0, 0, 0]]

for i in a:
    print(i)
    ''' вывод 
    [0, 0, 0, 0, 0]
    [0, 0, 0, 0, 0]
    [0, 0, 0, 0, 0]
    [0, 0, 0, 0, 0]
    '''

# ---------------------------------------------------------------
# _5 вложенный цикл, фиксируется первая переменная, пока не прокрутится вся вторая, потом первая шагает вперед ...
#  в итоге все возможные сочетания

e = [(i, j) for i in 'abc' for j in [1, 2, 3]]
print(e)  # --> [('a', 1), ('a', 2), ('a', 3), ('b', 1), ('b', 2), ('b', 3), ('c', 1), ('c', 2), ('c', 3)]

f = [i * j for i in [1, 2, 3, 4, 5] for j in [1, 2, 3] if i * j >= 10]
print(f)  # --> [12, 10, 15]